{
    "name":"FOS - Download File(s)"
   ,"version":"21.1.0"
   ,"description":"Download of database-stored BLOBs and CLOBs with a dynamic action. Multiple files are zipped automatically.\r\n\u003Ch4\u003EFree Plug-in under MIT License\u003C\/h4\u003E\r\n\u003Cp\u003E\r\nAll FOS plug-ins are released under MIT License, which essentially means it is free for everyone to use, no matter if commercial or private use. \r\n\u003C\/p\u003E\r\n\u003Ch4\u003EOverview\u003C\/h4\u003E\r\n\u003Cp\u003EThe \u003Cstrong\u003EFOS - Download File(s)\u003C\/strong\u003E dynamic action plug-in enables the downloading of one or multiple database-stored BLOBs or CLOBs. You don\u0027t have to worry about setting HTTP headers, converting CLOBs to BLOBs, or zipping the files. It\u0027s all done for you. Just specify which files to download via a SQL query, or a more dynamic PL\/SQL code block. Multiple files are zipped automatically, but a single file can optionally be zipped as well.\u003C\/p\u003E\r\n\u003Cp\u003EThe benefits of downloading a file using a dynamic action include:\r\n\u003Col\u003E\r\n    \u003Cli\u003EYou have the flexibility of using SQL to decide what file(s) to download including filtering based on page item values\u003C\/li\u003E\r\n    \u003Cli\u003EYou can have further actions defined after the download action for improved workflow\u003C\/li\u003E\r\n    \u003Cli\u003EYou can wait for the result of the file to download before continuing your next action\u003C\/li\u003E\r\n    \u003Cli\u003EYou do NOT issue a page submit or redirect, which means you can handle errors better i.e. you won\u0027t be redirected to an error page\u003C\/li\u003E\r\n\u003C\/ol\u003E    \r\n\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cstrong\u003ENote:\u003C\/strong\u003E in \"some cases\" you may need to change your security setting \"Embed in Frames\" and set it to either \"Allow from same origin\" or \"Allow\" for this action to work correctly in preview mode. This is because the file will be downloaded in a hidden iFrame on the page. If your setting is set to \"Deny\" you may see a message in the console like: \"Load denied by X-Frame-Options\". We evaluated a number of techniques to download files and found that this technique has the best performance with larger files.\u003C\/p\u003E\r\n\u003C\/p\u003E"
   ,"keywords":[
        "download"
       ,"files"
       ,"clob"
       ,"blob"
       ,"da"
    ]
   ,"license":"MIT"
   ,"commercial":"No"
   ,"commercially_supported":"Yes"
   ,"homepage":"https:\/\/github.com\/foex-open-source\/fos-download-files-da"
   ,"bugs":{
        "url":"https:\/\/github.com\/foex-open-source\/fos-download-files-da\/issues"
       ,"email":"support@fos.world"
    }
   ,"author":{
        "name":"FOEX GmbH"
       ,"email":"office@fos.world"
       ,"url":"https:\/\/foex.at\/fos\/"
       ,"twitter":"@foexopensource"
    }
   ,"repository":{
        "type":"git"
       ,"url":"https:\/\/github.com\/foex-open-source\/fos-download-files-da.git"
    }
   ,"oracle":{
        "versions":[
            "12.1.0.1"
           ,"12.2.0.1"
           ,"18.0.0.0"
           ,"19.0.0.0"
        ]
       ,"apex":{
            "versions":[
                "19.2.0"
               ,"20.1.0"
               ,"20.2.0"
            ]
           ,"plugin":{
                "internalName":"COM.FOS.DOWNLOAD_FILES_DA"
               ,"type":"dynamic action"
               ,"demo":"https:\/\/fos.world\/ords\/f?p=10000:1090"
               ,"previewImage":"https:\/\/fos.world\/ords\/fos_master_ws\/fos-image\/COM.FOS.DOWNLOAD_FILES_DA"
            }
        }
    }
}


